driver-tests/bpelse/assign/AssignJbi/test/echoNMTOKENDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://stc.com/echoNMTOKENDataType">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoNMTOKENDataType">
    <string>NMTOKEN</string>
    <normalizedString>NMTOKEN</normalizedString>
    <token>NMTOKEN</token>
    <base64Binary>NMTOKEN</base64Binary>
    <hexBinary>NMTOKEN</hexBinary>
    <integer>NMTOKEN</integer>
    <positiveInteger>NMTOKEN</positiveInteger>
    <negativeInteger>NMTOKEN</negativeInteger>
    <nonNegativeInteger>NMTOKEN</nonNegativeInteger>
    <nonPositiveInteger>NMTOKEN</nonPositiveInteger>
    <long>NMTOKEN</long>
    <unsignedLong>NMTOKEN</unsignedLong>
    <int>NMTOKEN</int>
    <unsignedInt>NMTOKEN</unsignedInt>
    <short>NMTOKEN</short>
    <unsignedShort>NMTOKEN</unsignedShort>
    <byte>NMTOKEN</byte>
    <unsignedByte>NMTOKEN</unsignedByte>
    <decimal>NMTOKEN</decimal>
    <float>NMTOKEN</float>
    <double>NMTOKEN</double>
    <boolean>NMTOKEN</boolean>
    <duration>NMTOKEN</duration>
    <dateTime>NMTOKEN</dateTime>
    <date>NMTOKEN</date>
    <time>NMTOKEN</time>
    <gYear>NMTOKEN</gYear>
    <gYearMonth>NMTOKEN</gYearMonth>
    <gMonth>NMTOKEN</gMonth>
    <gMonthDay>NMTOKEN</gMonthDay>
    <gDay>NMTOKEN</gDay>
    <Name>NMTOKEN</Name>
    <QName>NMTOKEN</QName>
    <NCName>NMTOKEN</NCName>
    <anyURI>NMTOKEN</anyURI>
    <language>NMTOKEN</language>
    <ID>NMTOKEN</ID>
    <IDREF>NMTOKEN</IDREF>
    <IDREFS>NMTOKEN</IDREFS>
    <ENTITY>NMTOKEN</ENTITY>
    <ENTITIES>NMTOKEN</ENTITIES>
    <NMTOKEN>NMTOKEN</NMTOKEN>
    <NMTOKENS>NMTOKEN</NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
